
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/autoupdate"

brew "checkov" # IaC policy check https://checkov.io
brew "chezmoi"
brew "direnv" # Conetxt based environment manager https://direnv.net/
brew "gh" # Github Cli
brew "git" # Git SCM client
brew "helm" # Package Manager for Kubernetes
brew "httpie" # Advanced HTTP client
brew "jq" # JSON Parser
brew "kubernetes-cli" # Kubecfg
brew "kube-linter" # Syntax checker for Kubernetes Manifests
brew "kube-ps1" # Shell prompt for Kubernetes
brew "kubectx" # Kunernetes context manager
brew "make"
brew "netcat"
brew "nmap"
brew "pipenv"
brew "pre-commit"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "k9s"
brew "yq"
brew "python"

#cask "1password" # Managed by Kandji
cask "1password-cli" # 1Password command line interface
cask "docker" # Docker Desktop
cask "github" # Github Desktop
cask "google-cloud-sdk" # Google Cloud SDK cand CLI
cask "postman" # Advanced HTTP Client

cask "balenaetcher" # Disk Imager
cask "iterm2" # Terminal Emulator
cask "keybase" # Keybase client
cask "obs" # Opem Broadcast Studio
cask "peakhour" # Network Bandwidth Monitor
cask "elgato-stream-deck" # Stream Deck Driver and Tools
cask "vlc" # Video Lan
cask "visual-studio-code" # Code Editor
cask "utm" # QEMU Wrapper