{{ if eq .chezmoi.os "darwin" -}}
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/autoupdate"
tap "osx-cross/arm"

brew "arm-gcc-bin" # GCC for PICO
brew "atmos" # Universal Tool for DevOps and Cloud Automation.
brew "checkov" # IaC policy check https://checkov.io
brew "chezmoi", args: ["overwrite"] # Dotfile manager https://chezmoi.io
brew "cloud-nuke" # Destroyer of clouds.
brew "cmake" # build thingy
brew "direnv" # Conetxt based environment manager https://diren/v.net
brew "eksctl" # EKS manager./
brew "gh" # Github Cli
brew "git" # Git SCM client
brew "graphviz" # Graph visualizer
brew "helm" # Package Manager for Kubernetes
brew "httpie" # Advanced HTTP client
brew "hugo" # Static site generator
brew "java" # Bloatware
brew "jq" # JSON Parser
brew "kubernetes-cli", args: ["overwrite"] # Kubecfg
brew "kube-linter" # Syntax checker for Kubernetes Manifests
brew "kube-ps1" # Shell prompt for Kubernetes
brew "kubectx" # Kunernetes context manager
brew "make"
brew "netcat"
brew "nmap"
brew "pipenv"
brew "pre-commit"
brew "terraform-docs"
brew "terraformer"
brew "terragrunt", args: ["ignore-dependencies"]
brew "tfenv"
brew "tflint"
brew "k9s"
brew "yq"
brew "python"
brew "go"
brew "fswatch"
brew "sops"
brew "kreuzwerker/taps/m1-terraform-provider-helper" # For m1 Mac compat.
brew "goenv"

cask "1password" # Managed by Kandji
#cask "1password-cli" # 1Password command line interface; requires admin password.
cask "basictex" # LaTex tools.
cask "camtasia" # Scrren recorder
cask "docker" # Docker Desktop
cask "github" # Github Desktop
cask "google-cloud-sdk" # Google Cloud SDK cand CLI
cask "postman" # Advanced HTTP Client
cask "slack" # Chat goblin
cask "balenaetcher" # Disk Imager
cask "iterm2" # Terminal Emulator
cask "keybase" # Keybase client
cask "obs" # Opem Broadcast Studio
cask "peakhour" # Network Bandwidth Monitor
cask "elgato-stream-deck" # Stream Deck Driver and Tools
cask "vlc" # Video Lan
cask "visual-studio-code" # Code Editor
cask "utm" # QEMU Wrapper
cask "skype" # OG voip
{{ end }}